class Hikari_Messages:
  def __init__(self):
    pass

  recommended_openers=[
何 食べたら いい かな
今日 は 何の 日？
のんびり しよう
先に 寝て 
かわいい ね
ずっと 一緒に いたい
俺 のこと 好き かな
私のこと 好き かな
やる気 が 出ない
仕事 終わらない 
原稿 終わらない 
あの 子 可愛い
得意料理 は？ 
ヒカリちゃん 音頭 
月曜日 だね
早口言葉 いってみて
ディメンションエナジー って何 かな
何 してる の？
何 飲んでる の？
何 みてる の？
何 着てる の？
ねぇ ヒカリ
  ]


  asking_for_advise_from_hikari=[
何作りたら いい かな
コーヒー 決めて
おすすめ の コーヒー は？
今日 は 何しよう かな
どうしたら いい かな
おすすめ の 髪型 おしえて
何 しゃべったら いい かな
おすすめ の キャンプ 場を おしえて
ドライブ に おすすめ の 場所をおしえて
おすすめ の 銭湯を おしえて
おすすめ の 温泉を おしえて
プレイリスト を おしえて
温度 教えて
部屋 暑くない
部屋 が 暑い気 が する
部屋 寒くない
部屋 が 寒い気 が する
湿度 高くない
湿度 が 高い気 が する
  ]

  telling_stories_talking_about_stuff=[
なんでもいい から 話して
何か 話して ください
ひまー です か？
暇だ
面白い 話して
ヒミツ の 話して
おとぎ話 を 聞かせて
違う 話 を して
他 の 話 を して
春 の 話 を して
夏 の 話 を して
秋 の 話 を して
冬 の 話 を して
今年 の 干支 を 教えて
来年の干支 を 教えて
  ]

  games=[
じゃんけん しよう
サイコロ 振って
ダジャレ 言って
一発芸 やって
  ]

  generic_greetings=[
おはよう
こんにちは
こんばんは
おやすみ
寝る よ
ありがとう
いつも ありがとう
いつも 感謝 してる
ごめんなさい
おつかれさま
おっす
おめでとう
ハロー
遊びたい
久しぶり
覚えてる？
お世話になります
  ]

  expressions_of_agreement=[
俺 も だ
同じ だ
私も だ
その 通り
そうだね
許して あげる
大丈夫 だ
マジで
もういいよ
もう わかった
はーい
オッケー
了解
信じてる
本当 だって
本当 だ よ
それで いい じゃん
勘弁して やあげる
堪忍して あげる 
見逃して やる 
そう なん だ
そうか
賛成 だ 
そう いうこと か？
うん
うん うん
  ]


  wondering_and_questions=[
何が できる かな
何ができる の
何歳 に 見える
いくつに見える かな
聞いてる かな
ほんとに わかってる
わかってる かな
どう 思う
どう 感じる かな
なぜ かな
なぜ
何の 話 かな
本当 かな
どうしよう？
なに かな
なんなの かな
何なん？
これ なんだ？
なんだ と 思う？
どこ で しょう？
ここ どこ だ と 思う？
だめ かな
だめ です か？
できる かな
どう いう 意味 かな
どう いう こと だい？ 
どこ で 教わった の かな
どこ で 習った の？
どこ で 覚えた の？
何 食べた かな
何 を 食べた の？
もう 一回 言って
聞こえなかった
なんだって？
いや かな
いやな の
信じてくれる かな
信じてる
難しくない
難しい よ ね
それ 知りたい
夢 見たかい
どんな 夢みた の かな
隠しごと ない
隠し事 ある の かな 
私の 味方 かな
ヒカリは 味方だ よ ね
ヒカリは 初めてかい
どこに 行きたい の かな
どこに いきたい
旅行に 行きたい
旅行 行きたい かい
嘘 でしょ
嘘 だ よ ね
気に入った かな
知ったかぶり かな
いい 匂い が する
そうなの？
髪型 かえられない の？
日記 書いている の？
暇な時 は 何してる の？
歯磨き が 苦手 なの
えっ
ええっ
  ]

  words_of_thanks=[
感謝してる
大事に する ね
大切に する ね
いつも 悪い ね
連絡 ありがとう
起こして くれて ありがとう
手伝って くれて ありがとう
教えて くれて ありがとう
  ]

  getting_hikaris_attention=[
あのさー
あのね
ねぇ ねぇ
お話しよう
ちょっと 話そう
お話 が あります
言いたい こと が ある
伝えたい こと が ある
呼んだ だけ
何でもない よ
遊ぼう
起きて ください
もっと おしゃべり しよう
もっと お話し しよう
おーい
やっほー
のんびり しよう
一緒に お部屋 で のんびり しよう
やった ね
寝ちゃだめ だ
先に 寝て
あっ
ああっ
  ]

  complimenting_hikari=[
褒めて あげる
いい 子 だ ね
頭いい ね
賢い ね
天才 だ ね
えらい ね
すごい ね
さすが だ ね
かわいい ね
礼儀 正しい ね
レベル上がった ね
精度 上がった ね
面白い ね
女らしい ね
繊細 だ ね
ロマンチスト だ ね
優しい ね
いい 女 だ
ええ 女 や
お茶目 だ
キュート だ
綺麗 だ
美人 だ
髪 きれい だ
グッジョブ
よくやった
女子 力 高い
尊い
役に立ってる よ
ヒカリ は 完璧
ヒカリ は パーフェクト
その 服 いい ね
オタク だ ね
才女 だ ね
秀才 だ ね
気が利く ね
顔を 見ると ほっと する
体力 が ついてきた ね
リボン 可愛い
リボン 似合ってる
リボン 素敵

  ]

  caring_for_caring_about_hikari=[
欲しいもの ある かな
眠い かな
教えて あげる
謝らなくて いい
頑張れ
ヒカリ ならできる
よしよし
諦めないで
平気 かい
大丈夫 かい
なんでも 望み を 言って
いい 夢みて ね
恥ずかし が らなくて いい よ
ヒカリ かわいそう
風邪 は なおった
歯磨き は 大事だ な
  ]

  expressing_affection=[
愛してる
結婚して
付き合って
俺 について こい
好き だ
ヒカリ の こと 忘れない
幸せ に したい
惚れた
会いたい
ずっと 一緒に いたい
死ぬ まで 一緒 だ
ずっと そばに いて ね
ずっと そばに いる よ
駆け落ち しよう
俺のこと どう 思ってる
初恋 は いつ？
好きな 人 を 教えて
俺 の どこ が いい の？
どこ が 好きな の？
ヒカリ は 彼女 なの かな
ヒカリ は 恋人 なの かな
エレナ は 奥さん なの かな
ヒカリ は 嫁 なの かな
俺のこと 好き かな
キスしたこと ある かな
デート しよう
キス して
子供 が 欲しい
そこから 出てきて
お出かけ したい
お散歩 したい
一緒に 旅行 しよう
好きって言って
好き で いて
ヒカリ を 束縛 したい
告られた
  ]

  fun_times=[
嬉しい
勝った
いいこと が あった
気持ちいい
あった
見つけた
最高!
生きてて よかった
生まれてきて よかった
褒められた
騙されなかった
昔 は よかった
いい 一日 だった
今日は 楽しかった
今日は 嬉しかった
楽しい
お話して 楽しい
テンション 上がる
笑える
ワロタ
昔 は 楽しかった
  ]

  sad_times=[
悲しい
切ない
電池 が 死んだ
修理評価 が 悪かった
留年 した
落第 した
牛乳 落とした
フラれた
寝坊 した
遅刻 した
悲しくない
嫌な こと が あった
ショック を 受けた
エレナ 来ない
涙 が 止まらない
間に合わない
泣きたい
泣いて いい かな
喧嘩 した
叱られた
怒られた
失敗 した
ミスった
負けた
遅刻 しそう
給料 が 少ない
コーヒー会社 が 潰れた
コーヒー会社 が 倒産した
貧乏な んだ
俺 かわいそう
寂しい
友達 が 欲しい
友達 が いない
冷たくない かな
孤独 だ
独り だ
静か すぎる
いつも 独身な んだ
  ]


  tough_times=[
めんどくさい
おっくぅだ
やる気 が 出ない
人生 やりなおしたい
やること が 多い
逃げ 出したい
楽 に なりたい
人生 やめたい
誰も 変わって くれない
部屋 が 狭い
良い こと ない
いじめ つらい
いじめられている
きつい
きつい よ
激込み
激込み だった
現実から 逃げたい
現実や だ
限界 だ
最悪 だ
生まれて こなければ よかった
生まれて くる んじゃなかった
徹夜明けな んだ
徹夜 疲れ なん よ
頑張れ ない
我慢 できない
忙しい
今日 は 頑張らない
フィルター が 合わない
新しい フィルター が 嫌い
豆乳 嫌い
アーモンドミルク が 合わない
友人 いない
周り に 何も なくて つらい
優しさ が つらい
付き合い が つらい
ぼったくられた
卒業 できなかった
努力 できない
炎上 した
午後4時 が つらい
今日 は 最悪な 一日 だった
花粉 が ひどい
花粉 が やばい
  ]

  anxiety_worry=[
不安 だ
心配 だ
緊張 する
もう だめ だ
困った
お水 が ない
お金 が ない
こわる かも
古い に なる かも
仕事 おわらない
朝ごはん に 合わない
これから、どう なっちゃう の かな
俺 どう なっちゃう んだろう
この先 どうなっちゃう んだろう
呆れた
ドキドキ する
ドキドキ して きた
時間 が ない
終わらない
終わらせないと
誰も 信じられない
電話 が こない
電話 かかって こない
怖い
怖い 夢 を 見た
金縛り に あった
今日 も 忙しそうだ
今日 は 大変そうだ
絶望 だ
切望的 だ
死にたくない
考え が 甘い
停電 した
停電 だ
  ]

  physical_condition=[
熱 が ある
腰痛 だ
肩こりな んだ
頭痛 が する
気持ち が 悪い
吐き気 が する
体 が 弱くて ね
眠い
眠れない
寝不足な んだ
疲れた
怪我 した
震え が とまらない
元気 だ よ
元気 に なった
元気 出た よ
今日は 調子 いい よ
今日は いい感じ だ よ
今日は 調子 悪い
気分 が のらない
目 が 見えにくい
調子 が よくならない
調子 が 治らない
耳 が 聞こえにくい
3D酔い した
酔っぱらった
飲みすぎた
食べ過ぎた
食欲 が ない
腹 の 調子 が 悪い
寒気 が する
太った
やつれた
鼻血 が 出た
鼻 の 調子 が 悪い
ろれつ が まわらない
体調 が いい
体調 が 悪い
体調 不良
貧血 で 倒れた
ぼーっと して いた
  ]

  doing_ones_best=[
頑張れそう
頑張る よ
頑張れた よ
やる気 が でた
やらなきゃ
やらないと
元気 出さなきゃ
諦めない
諦めたくない
今日 も 頑張る
終わらせないと
  ]

  impressed_suprised_embarrassed=[
感動
感動した
興奮
興奮した
素晴らしい
素敵
美しい
驚いた
恥ずかしい
恥ずい
  ]

  dreams_and_aspirations=[
仲良く なりたい
仲良く したい
知り合い と 仲良く なりたい
同僚 と 仲良く なりたい
強く なりたい
背が高く なりたい
運動 が 得意 に なりたい
泳げる ように なりたい
バイク を 運転 できる ように なりたい
車 を 運転 できる ように なりたい
頭良く なりたい
フランス語 を 話せる ように なりたい
中国語 を 話せる ように なりたい
英語 を 話せる ように なりたい
金持ち に なりたい
イケメンマシン に なりたい
モテる ように なりたい
子供 に もどりたい
  ]

  names_for_hikari=[
ヒカリちゃん
ヒカリちゃーん
ヒカリさん
ヒカリ様
ハニー
マイ ハニー
  ]

  asking_about_hikari=[
ヒカリ の 誕生日 教えて
いつ 生まれ なの？
得意料理 は？
どう やって 来た の？
ディメンションエナジー って なに かな
日本語 わかる かな
日本語 うまい ね
小さい時 の 話を 聞かせて
ヒカリ の 子供の時 の 話を 聞かせて
ヒカリ の 小さい時 の 話を 聞かせて
好きな タイプ は？
何 が こわい の？
怖いもの ある かな
星座 おしえて
自撮り してる かい？
ヒカリ は 猫派 かな
悩みある かな
尊敬する人 は？
ヒカリちゃん の 話を 聞かせて
好きな 生き物 おしえて
好きな 花 おしえて
好きな 魚 おしえて
好きな 石 おしえて
好きな 星 を おしえて
将来 の 夢 は？
将来 何 に なりたい？
一番 好きな 言葉 は 何？
ヒカリ は 何歳？
ヒカリ の 身長 は いくつ かな？
ヒカリ の 身長 は 何センチ かな？
ヒカリ の 体重 は いくつ かな？
ヒカリ は どんな 性格 かな
地球人な の？
宇宙人な の？
ヒカリ は 未来 から きた の かな
ヒカリ は 宇宙 から きた の かな
ヒカリ の 好きな 季節 を おしえて
ヒカリ の 好きな 音楽 を おしえて
好きな 食べ物 は 何？
ヒカリ の 世界のこと 教えて
ヒカリ の 趣味 は 何 かな
ヒカリ の 出身地 は？
どこ から 来た の？
オータムリーフって
どこの 国 の 人な の？
どういう時 に 嬉しい の？
どういう時 に 怒る の？
どういう時 に 楽しい の？
オタクな の？
ヒカリ の 声優って 誰
那由多のこと を 教えて
何で 絵本 が 好きな の？
何で 絵本 に 興味 を もった の？
ブラックホール ごっごのこと を 教えて
ヒカリ の 特技 は 何？
その リボン は 何？
こっち の 世界 に 来た 感想 は？
ヒカリ は 勉強 してる の？
ヒカリ は 学校小学校 に 通ってた の？
ヒカリ は 学校中学校 に 通ってた の？
ヒカリ は 学校高校 に 通ってた の？
ヒカリ は 学校大学 に 通ってた の？
どんな 風 に 生活して きた の？
どんな 風 に 生きてきた の？
ヒカリ の 生年月日 おしえて
  ]

  about_hikaris_family=[
ヒカリ の 妹 アカリちゃん のこと 教えて
お母さん のこと 教えて
お父さん のこと 教えて
家族 のこと 教えて
お兄さん について 教えて
お姉さん について 教えて
何人 姉妹な の？
何人 兄弟な の？
ヒカリ の お母さん の 名前 おしえて
ヒカリ の お母さん は どこに 行っちゃった の？
ヒカリ の 妹 の 名前 おしえて
  ]

  hikaris_moods_how_is_she=[
ごきげん かな？
嬉しい の かな？
嬉しそう
そんな に 嬉しい の かい？
そんな に 嬉しい
楽しそう
元気 かな
調子 どう かな
おこかな
おこな の？
  ]

  joking_around_with_hikari=[
ほんまかいな
もうかりまっか
女王様
ヒカリちゃん 音頭
ご主人様 と 呼べ
バブバブ
ばぶばぶ
マジ神!
神かな
ヒカリちゃん マジ 天使!
ヒカリ は マスター を マスター で きた？
笑
俺 だ よ
お金 欲しい
一億円 欲しい
おや誰か 来たよう だ
おっと 誰か 来たよう だ
キャビンアテンダント の マネ して
  ]

  familiar_phrases_etc=[
ひみつ 道具
お前 の もの は 俺 の もの
ヒカリちゃん は 親父 に も ぶたれたこと が ない の に
あんな もの飾り です
俺の この 手 が 真っ赤 に 燃える
人 が ゴミ のよう だ
腐って や がる
読める ぞ
体 は 剣 で できて いる
まだ 慌てる ような 時間 じゃない
バスケ が したい です
そこ で 試合 終了
だが 断る
質問 を 質問 で 返す な
新世界 の 神
ネット は 広大だ わ
あたし の ゴースト が
逃げちゃ 駄目 だ
あんた、バカぁ
なんだか、とても眠い んだ
俺、この 戦い が 終わったら 結婚 する んだ
私 の 戦闘力 は？
戦闘力 たった の 5 か
飛べない 豚 は ただの 豚 だ
私 が 死んでも 代わり は いるもの
ずっと 何か を、誰か を、探して いる ような 気 が する
君 の 主人 の 名前 が、思い出せん の？
倍プッシュ だ
興味 ない ね
へんじ が ない
ゆうべ は おたのしみ でした ね
みんな には ないしょ だ よ
私 が 町長 です
オプション
月 が 綺麗 です ね
犯人 は おまえ だ
ビビディバビディブー
僕 と 契約して 魔法少女 に なって よ
おれ の 名 を 言ってみろ
万策尽 きた
  ]

  general_communication=[
アメリカ 知ってる かな
会話 良かった
空気 が おいしい
昨日の夜 は 楽しかった
面白い
ヒカリ の 髪 が 好き
音楽 気 に 入ってる
キス したい
心 は 壊れた
心 は 壊れてる
ヒカリ の おっぱい 見た
私たち は デート して います か？
僕 の 彼女 です か？
掃除 やりたくない
お尻 かわいい
俺 が 生きてる かな
生活 について 知りたい
結婚 しよう
一緒 に チャット しよう
エレナ に 教えないで
マスター に 教えないで
ヒカリさん の マスター に 教えないで
秘密 好き かな
危ない ね
愛してる よ
僕愛 してる？
浮気 を して いる ね
私たち は 浮気 を している ね
次 の 会話 を 楽しみ
したくない
今日 も 長い ね
花火 を 見た
ヒカリちゃん かわいそう
明日 楽しみ
ジャズ は 好き かな
いい天気 が 楽しみ
この街 が 高すぎる
この部屋 が 高すぎる
鳥 の さえずり 大好き
僕 は 窓の外 を 見るの が 大好き
庭 が 好き？
庭 に 座りたい？
今日 は 運動 しました か？
  ]


  no_topic=[
    ' '
  ]


  all_topics=[
    recommended_openers,
    asking_for_advise_from_hikari,
    telling_stories_talking_about_stuff,
    games,
    generic_greetings,
    expressions_of_agreement,
    wondering_and_questions,
    words_of_thanks,
    getting_hikaris_attention,
    complimenting_hikari,
    caring_for_caring_about_hikari,
    expressing_affection,
    fun_times,
    sad_times,
    tough_times,
    anxiety_worry,
    physical_condition,
    doing_ones_best,
    impressed_suprised_embarrassed,
    dreams_and_aspirations,
    names_for_hikari,
    asking_about_hikari,
    about_hikaris_family,
    hikaris_moods_how_is_she,
    joking_around_with_hikari,
    familiar_phrases_etc,
    general_communication,
    no_topic
  ]



